STMicroelectronics/STM32CubeG4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF2ADCL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF2ADCL_ENA_MASK        (uint16_t)0x2000U
#define   WM8994_PWR_MGMT_4_AIF2ADCL_ENA_POSITION    13
int32_t   wm8994_pwr_mgmt_4_aif2adcl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: DAC1R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_DAC1R_ENA_MASK        (uint16_t)0x0001U
#define   WM8994_PWR_MGMT_5_DAC1R_ENA_POSITION    0
int32_t   wm8994_pwr_mgmt_5_dac1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: DAC1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_DAC1L_ENA_MASK        (uint16_t)0x0002U
#define   WM8994_PWR_MGMT_5_DAC1L_ENA_POSITION    1
int32_t   wm8994_pwr_mgmt_5_dac1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: DAC2R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_DAC2R_ENA_MASK        (uint16_t)0x0004U
#define   WM8994_PWR_MGMT_5_DAC2R_ENA_POSITION    2
int32_t   wm8994_pwr_mgmt_5_dac2r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: DAC2L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_DAC2L_ENA_MASK        (uint16_t)0x0008U
#define   WM8994_PWR_MGMT_5_DAC2L_ENA_POSITION    3
int32_t   wm8994_pwr_mgmt_5_dac2l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF1DAC1R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF1DAC1R_ENA_MASK        (uint16_t)0x0100U
#define   WM8994_PWR_MGMT_5_AIF1DAC1R_ENA_POSITION    8
int32_t   wm8994_pwr_mgmt_5_aif1dac1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF1DAC1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF1DAC1L_ENA_MASK        (uint16_t)0x0200U
#define   WM8994_PWR_MGMT_5_AIF1DAC1L_ENA_POSITION    9
int32_t   wm8994_pwr_mgmt_5_aif1dac1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF1DAC2R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF1DAC2R_ENA_MASK        (uint16_t)0x0400U
#define   WM8994_PWR_MGMT_5_AIF1DAC2R_ENA_POSITION    10
int32_t   wm8994_pwr_mgmt_5_aif1dac2r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF1DAC2L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF1DAC2L_ENA_MASK        (uint16_t)0x0800U
#define   WM8994_PWR_MGMT_5_AIF1DAC2L_ENA_POSITION    11
int32_t   wm8994_pwr_mgmt_5_aif1dac2l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF2DACR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF2DACR_ENA_MASK        (uint16_t)0x1000U
#define   WM8994_PWR_MGMT_5_AIF2DACR_ENA_POSITION    12
int32_t   wm8994_pwr_mgmt_5_aif2dacr_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_5
* Address       : 0X05
* Bit Group Name: AIF2DACL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_5_AIF2DACL_ENA_MASK        (uint16_t)0x2000U
#define   WM8994_PWR_MGMT_5_AIF2DACL_ENA_POSITION    13
int32_t   wm8994_pwr_mgmt_5_aif2dacl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_6
* Address       : 0X06
* Bit Group Name: AIF1_DACDAT_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_6_AIF1_DACDAT_SRC_MASK        (uint16_t)0x0001U
#define   WM8994_PWR_MGMT_6_AIF1_DACDAT_SRC_POSITION    0
int32_t   wm8994_pwr_mgmt_6_aif1_dacdat_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_6
* Address       : 0X06
* Bit Group Name: AIF2_DACDAT_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_6_AIF2_DACDAT_SRC_MASK        (uint16_t)0x0002U
#define   WM8994_PWR_MGMT_6_AIF2_DACDAT_SRC_POSITION    1
int32_t   wm8994_pwr_mgmt_6_aif2_dacdat_src(wm8994_ctx_t *ctx, uint16_t value);

