STMicroelectronics/STM32CubeG4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN34_VOL
* Address       : 0X19
* Bit Group Name: IN1_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN2_VU_MASK        (uint16_t)0x0100U
#define   WM8994_LLI_IN2_VU_POSITION    8
int32_t   wm8994_lli_in2_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN12_VOL
* Address       : 0X1A
* Bit Group Name: IN1R_VOL [4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN1R_VOL_MASK        (uint16_t)0x001F
#define   WM8994_RLI_IN1R_VOL_POSITION    0
int32_t   wm8994_rli_in1r_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN12_VOL
* Address       : 0X1A
* Bit Group Name: IN1R_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN1R_ZC_MASK        (uint16_t)0x0040U
#define   WM8994_RLI_IN1R_ZC_POSITION    6
int32_t   wm8994_rli_in1r_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN12_VOL
* Address       : 0X1A
* Bit Group Name: IN1R_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN1R_MUTE_MASK        (uint16_t)0x0080U
#define   WM8994_RLI_IN1R_MUTE_POSITION    7
int32_t   wm8994_rli_in1r_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN12_VOL
* Address       : 0X1A
* Bit Group Name: IN1_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN1_VU_MASK        (uint16_t)0x0100U
#define   WM8994_RLI_IN1_VU_POSITION    8
int32_t   wm8994_rli_in1_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN34_VOL
* Address       : 0X1B
* Bit Group Name: IN2R_VOL [4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN2R_VOL_MASK        (uint16_t)0x001F
#define   WM8994_RLI_IN2R_VOL_POSITION    0
int32_t   wm8994_rli_in2r_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN34_VOL
* Address       : 0X1B
* Bit Group Name: IN2R_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN2R_ZC_MASK        (uint16_t)0x0040U
#define   WM8994_RLI_IN2R_ZC_POSITION    6
int32_t   wm8994_rli_in2r_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN34_VOL
* Address       : 0X1B
* Bit Group Name: IN2R_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN2R_MUTE_MASK        (uint16_t)0x0080U
#define   WM8994_RLI_IN2R_MUTE_POSITION    7
int32_t   wm8994_rli_in2r_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_LINE_IN34_VOL
* Address       : 0X1B
* Bit Group Name: IN2_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_RLI_IN2_VU_MASK        (uint16_t)0x0100U
#define   WM8994_RLI_IN2_VU_POSITION    8
int32_t   wm8994_rli_in2_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_OUTPUT_VOL
* Address       : 0X1C
* Bit Group Name: HPOUT1L_VOL [5:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_LO_HPOUT1L_VOL_MASK        (uint16_t)0x003F
#define   WM8994_LO_HPOUT1L_VOL_POSITION    0
int32_t   wm8994_lo_hpout1l_vol(wm8994_ctx_t *ctx, uint16_t value);
int32_t   wm8994_lo_hpout1l_vol_r(wm8994_ctx_t *ctx, uint16_t *value);

/*******************************************************************************
* Register      : WM8994_LEFT_OUTPUT_VOL
* Address       : 0X1C
* Bit Group Name: HPOUT1L_MUTE_N
* Permission    : RW
*******************************************************************************/
#define   WM8994_LO_HPOUT1L_MUTE_N_MASK        (uint16_t)0x0040U
#define   WM8994_LO_HPOUT1L_MUTE_N_POSITION    6
int32_t   wm8994_lo_hpout1l_mute_n(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_OUTPUT_VOL
* Address       : 0X1C
* Bit Group Name: HPOUT1L_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_LO_HPOUT1L_ZC_MASK        (uint16_t)0x0080U
#define   WM8994_LO_HPOUT1L_ZC_POSITION    7
int32_t   wm8994_lo_hpout1l_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_OUTPUT_VOL
* Address       : 0X1C
* Bit Group Name: HPOUT1L_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_LO_HPOUT1L_VU_MASK        (uint16_t)0x0100U
#define   WM8994_LO_HPOUT1L_VU_POSITION    8
int32_t   wm8994_lo_hpout1l_vu(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_RIGHT_OUTPUT_VOL
* Address       : 0X1D
* Bit Group Name: HPOUT1R_VOL [5:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_RO_HPOUT1R_VOL_MASK        (uint16_t)0x003F
#define   WM8994_RO_HPOUT1R_VOL_POSITION    5
int32_t   wm8994_ro_hpout1r_vol(wm8994_ctx_t *ctx, uint16_t value);

