STMicroelectronics/STM32CubeG4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_RIGHT_OUTPUT_VOL
* Address       : 0X1D
* Bit Group Name: HPOUT1R_MUTE_N
* Permission    : RW
*******************************************************************************/
#define   WM8994_RO_HPOUT1R_MUTE_N_MASK        (uint16_t)0x0040U
#define   WM8994_RO_HPOUT1R_MUTE_N_POSITION    6
int32_t   wm8994_ro_hpout1r_mute_n(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_OUTPUT_VOL
* Address       : 0X1D
* Bit Group Name: HPOUT1R_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_RO_HPOUT1R_ZC_MASK           (uint16_t)0x0080
#define   WM8994_RO_HPOUT1R_ZC_POSITION       7
int32_t   wm8994_ro_hpout1r_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_RIGHT_OUTPUT_VOL
* Address       : 0X1D
* Bit Group Name: HPOUT1R_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_RO_HPOUT1R_VU_MASK          (uint16_t)0x0100
#define   WM8994_RO_HPOUT1R_VU_POSITION      8
int32_t   wm8994_ro_hpout1r_vu(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x1E, (uint16_t)0x1F, (uint16_t)0x20 and (uint16_t)0x21 are not implemented here */

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: SPKMIXL_VOL[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_VOL_MASK          (uint16_t)0x0003
#define   WM8994_SPKMIXL_ATT_VOL_POSITION      0
int32_t   wm8994_spkmixl_att_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: DAC1L_SPKMIXL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_DAC1_VOL_MASK          (uint16_t)0x0004
#define   WM8994_SPKMIXL_ATT_DAC1_VOL_POSITION      2
int32_t   wm8994_spkmixl_att_dac1_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: MIXOUTL_SPKMIXL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_MIXOUTL_VOL_MASK          (uint16_t)0x0008
#define   WM8994_SPKMIXL_ATT_MIXOUTL_VOL_POSITION      3
int32_t   wm8994_spkmixl_att_mixoutl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: IN1LP_SPKMIXL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_IN1LP_VOL_MASK          (uint16_t)0x0010
#define   WM8994_SPKMIXL_ATT_IN1LP_VOL_POSITION      4
int32_t   wm8994_spkmixl_att_in1lp_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: MIXINL_SPKMIXL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_MIXINL_VOL_MASK          (uint16_t)0x0020
#define   WM8994_SPKMIXL_ATT_MIXINL_VOL_POSITION      5
int32_t   wm8994_spkmixl_att_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: DAC2L_SPKMIXL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_DAC2L_VOL_MASK          (uint16_t)0x0040
#define   WM8994_SPKMIXL_ATT_DAC2L_VOL_POSITION      6
int32_t   wm8994_spkmixl_att_dac2l_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXL_ATT
* Address       : 0X22
* Bit Group Name: SPKAB_REF_SEL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXL_ATT_SPKAB_REFSEL_MASK          (uint16_t)0x0100
#define   WM8994_SPKMIXL_ATT_SPKAB_REFSEL_POSITION      8
int32_t   wm8994_spkmixl_att_spkab_refsel(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: SPKMIXR_VOL[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_VOL_MASK          (uint16_t)0x0003
#define   WM8994_SPKMIXR_ATT_VOL_POSITION      0
int32_t   wm8994_spkmixr_att_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: DAC1R_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_DAC1_VOL_MASK          (uint16_t)0x0004
#define   WM8994_SPKMIXR_ATT_DAC1_VOL_POSITION      2
int32_t   wm8994_spkmixr_att_dac1_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: MIXOUTR_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_MIXOUTL_VOL_MASK          (uint16_t)0x0008
#define   WM8994_SPKMIXR_ATT_MIXOUTL_VOL_POSITION      3
int32_t   wm8994_spkmixr_att_mixoutl_vol(wm8994_ctx_t *ctx, uint16_t value);

