STMicroelectronics/STM32CubeG4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_FILTERS
* Address       : 0X410
* Bit Group Name: AIF1ADC1L_HPF
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_FILTERS_ADC1L_HPF_MASK                 (uint16_t)0x1000
#define   WM8994_AIF1_ADC1_FILTERS_ADC1L_HPF_POSITION             12
int32_t   wm8994_aif1_adc1_filters_adc1l_hpf(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_FILTERS
* Address       : 0X410
* Bit Group Name: AIF1ADC1_HPF_CUT[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_FILTERS_HPF_CUT_MASK                 (uint16_t)0x6000
#define   WM8994_AIF1_ADC1_FILTERS_HPF_CUT_POSITION             13
int32_t   wm8994_aif1_adc1_filters_hpf_cut(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_FILTERS
* Address       : 0X410
* Bit Group Name: AIF1ADC_4FS
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_FILTERS_4FS_MASK                 (uint16_t)0x8000
#define   WM8994_AIF1_ADC1_FILTERS_4FS_POSITION             15
int32_t   wm8994_aif1_adc1_filters_4fs(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_FILTERS
* Address       : 0X411
* Bit Group Name: AIF1ADC2R_HPF
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC2_FILTERS_ADC2R_HPF_MASK                 (uint16_t)0x0800
#define   WM8994_AIF1_ADC2_FILTERS_ADC2R_HPF_POSITION             11
int32_t   wm8994_aif1_adc2_filters_adc2r_hpf(wm8994_ctx_t *ctx, uint16_t value);
		 
/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_FILTERS
* Address       : 0X411
* Bit Group Name: AIF1ADC2L_HPF
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC2_FILTERS_ADC2L_HPF_MASK                 (uint16_t)0x1000
#define   WM8994_AIF1_ADC2_FILTERS_ADC2L_HPF_POSITION             12
int32_t   wm8994_aif1_adc2_filters_adc2l_hpf(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_FILTERS
* Address       : 0X411
* Bit Group Name: AIF1ADC2_HPF_CUT[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC2_FILTERS_HPF_CUT_MASK                 (uint16_t)0x6000
#define   WM8994_AIF1_ADC2_FILTERS_HPF_CUT_POSITION             13
int32_t   wm8994_aif1_adc2_filters_hpf_cut(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_FILTERS
* Address       : 0X411
* Bit Group Name: AIF1ADC_4FS
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC2_FILTERS_4FS_MASK                 (uint16_t)0x8000
#define   WM8994_AIF1_ADC2_FILTERS_4FS_POSITION             15
int32_t   wm8994_aif1_adc2_filters_4fs(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X420
* Bit Group Name: AIF1DAC1_DEEMP [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_FILTER1_DEEMP_MASK                 (uint16_t)0x0006
#define   WM8994_AIF1_DAC1_FILTER1_DEEMP_POSITION             1
int32_t   wm8994_aif1_dac1_filter1_deemp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X420
* Bit Group Name: AIF1DAC1_UNMUTE_RAMP
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_FILTER1_UNMUTE_RAMP_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC1_FILTER1_UNMUTE_RAMP_POSITION             4
int32_t   wm8994_aif1_dac1_filter1_unmute_ramp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X420
* Bit Group Name: AIF1DAC1_MUTERATE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_FILTER1_MUTERATE_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC1_FILTER1_MUTERATE_POSITION             5
int32_t   wm8994_aif1_dac1_filter1_muterate(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X420
* Bit Group Name: AIF1DAC1_MONO
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_FILTER1_MONO_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1_DAC1_FILTER1_MONO_POSITION             7
int32_t   wm8994_aif1_dac1_filter1_mono(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X420
* Bit Group Name: AIF1DAC1_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_FILTER1_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_AIF1_DAC1_FILTER1_MUTE_POSITION             9
int32_t   wm8994_aif1_dac1_filter1_mute(wm8994_ctx_t *ctx, uint16_t value);

