STMicroelectronics/STM32CubeG4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_OP_CFG
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_OP_CFG_MASK                 (uint16_t)0x0200
#define   WM8994_GPIO1_GP1_OP_CFG_POSITION             9
int32_t   wm8994_gpio1_gp1_op_cfg(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_POL
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_POL_MASK                 (uint16_t)0x0400
#define   WM8994_GPIO1_GP1_POL_POSITION             10
int32_t   wm8994_gpio1_gp1_pol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_PD
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_PD_MASK                 (uint16_t)0x2000
#define   WM8994_GPIO1_GP1_PD_POSITION             13
int32_t   wm8994_gpio1_gp1_pd(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_PU
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_PU_MASK                 (uint16_t)0x4000
#define   WM8994_GPIO1_GP1_PU_POSITION             14
int32_t   wm8994_gpio1_gp1_pu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_DIR
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_DIR_MASK                 (uint16_t)0x8000
#define   WM8994_GPIO1_GP1_DIR_POSITION             15
int32_t   wm8994_gpio1_gp1_dir(wm8994_ctx_t *ctx, uint16_t value);

#ifdef __cplusplus
}
#endif

#endif /* WM8994_REG_H */

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
